# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-pose-p6 keypoints/pose estimation model. For Usage examples see https://docs.ultralytics.com/tasks/pose

# Parameters
nc: 1  # number of classes
#kpt_shape: [17, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n-p6.yaml' will call yolov8-p6.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

head_channel: 512

# YOLOv8.0x6 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [768, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [768, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 9-P6/64
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 11-P7/128
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 13

# YOLOv8.0x6 head
head:
  - [4, 1, Conv, [head_channel]]  # 14-P3/8
  - [6, 1, Conv, [head_channel]]  # 15-P4/16
  - [8, 1, Conv, [head_channel]]  # 16-P5/32
  - [10, 1, Conv, [head_channel]]  # 17-P6/32
  - [13, 1, Conv, [head_channel]]  # 18-P7/32

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 17], 1, Bi_FPN, []]  # cat backbone P6
  - [-1, 3, C2f, [head_channel, False]]  # 21

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 16], 1, Bi_FPN, []]  # cat backbone P5
  - [-1, 3, C2f, [head_channel, False]]  # 24

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 15], 1, Bi_FPN, []]  # cat backbone P4
  - [-1, 3, C2f, [head_channel, False]]  # 27

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 14], 1, Bi_FPN, []]  # cat backbone P3
  - [-1, 3, C2f, [head_channel, False]]  # 30 (P3/8-small)

  - [2, 1, Conv, [head_channel, 3, 2]] # P2->P3
  - [[-1, 14, 30], 1, Bi_FPN, []]  #
  - [-1, 3, C2f, [head_channel, False]]  # 33 (P3/8)

  - [-1, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 15, 27], 1, Bi_FPN, []]  # cat head P4
  - [-1, 3, C2f, [head_channel, False]]  # 36 (P4/16-medium)

  - [-1, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 16, 24], 1, Bi_FPN, []]  # cat head P5
  - [-1, 3, C2f, [head_channel, False]]  # 39 (P5/32-large)

  - [-1, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 17, 21], 1, Bi_FPN, []]  # cat head P6
  - [-1, 3, C2f, [head_channel, False]]  # 42 (P6/64-xlarge)

  - [-1, 1, Conv, [head_channel, 3, 2]]
  - [[-1, 18], 1, Bi_FPN, []]  # cat head P7
  - [-1, 3, C2f, [head_channel, False]]  # 45 (P7/128-xlarge)

  - [[33, 36, 39, 42, 45], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5, P6, P7)
